# Assignment 3 (Week 3)


## Name: Theresa Louise Bazudde

In [1]:
# Standard imports
import numpy as np
import pandas as pd

# pandas settings
pd.options.display.max_rows = 1_000
pd.options.display.max_columns = 1_000
pd.options.display.max_colwidth = 1_000

# Qs 1

## Part a

In [2]:
x = np.linspace(0, 10, 10001)
y = print(np.exp(-x/10)*np.sin(x))

[ 0.          0.0009999   0.0019996  ... -0.19955634 -0.19984539
 -0.20013418]

## Part b

In [3]:
rng = np.random.default_rng(seed=5)
X = rng.random(size=(35, 2), dtype=np.float32)
y = rng.random(size=(35, 1), dtype=np.float32)

#calculating means
x_mean = np.mean(x)
y_mean = np.mean(y)

#numerator
numerator = sum((x-x_mean)*(y-y_mean))
#denominator
denominator = sum((x-x_mean)**2)

result = print(numerator/denominator)

[ 1.78760303e-11  1.78724550e-11  1.78688798e-11 ... -1.78688799e-11
 -1.78724550e-11 -1.78760303e-11]

# Qs 2

## Part a

In [4]:
rng = np.random.default_rng(seed=5)
X = rng.random(size=(16, 3), dtype=np.float32).reshape(2, 4, 2, 3)
indices = np.where(X == 0.1777215)
print("Indices of x are:", indices)

Indices of x are: (array([1], dtype=int64), array([0], dtype=int64), array([1], dtype=int64), array([1], dtype=int64))

## Part b

In [5]:
rng = np.random.default_rng(seed=5)
X = rng.random(size=(16, 3), dtype=np.float32).reshape(2, 4, 2, 3)
indices = np.where(X == 0.51532555)
print("Indices of x are:", indices)

Indices of x are: (array([0], dtype=int64), array([0], dtype=int64), array([1], dtype=int64), array([2], dtype=int64))

# Qs 3

In [6]:
df = pd.read_csv('HR_Employee_reduced.csv')
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'JobRole', 'EnvironmentSatisfaction', 'Gender',
       'PerformanceRating', 'HourlyRate', 'JobInvolvement', 'JobLevel'],
      dtype='object')

## Part a

In [7]:
query = df.loc[(df['Age']>30)&(df['JobRole'].isin(['manager','research director','manufacturing director']))&(df['PerformanceRating']>3)]

## Part b

In [8]:
#defining a function to make education_field to new label
def create_others(EducationField):
    """
    Given an education field, returns 'others' if the field is 'technical degree', 'other', or 'human resources',
    and the input field otherwise.

    Args:
        EducationField (str): The education field to be processed.

    Returns:
        str: The processed education field.

    Examples:
        >>> create_others('technical degree')
        'others'
        >>> create_others('engineering')
        'engineering'
    """
    if EducationField in ['technical degree', 'other', 'human resources']:
        return 'others'
    else:
        return EducationField
#applying the function
df['others'] = df['EducationField'].apply(create_others)
df.head(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,JobRole,EnvironmentSatisfaction,Gender,PerformanceRating,HourlyRate,JobInvolvement,JobLevel,others
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,Sales Executive,2,Female,3,94,3,2,Life Sciences
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,Research Scientist,3,Male,4,61,2,2,Life Sciences
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,Laboratory Technician,4,Male,3,92,2,1,Other
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,Research Scientist,4,Female,3,56,3,1,Life Sciences
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,Laboratory Technician,1,Male,3,40,3,1,Medical

## Part c

In [9]:
numerical_data = df.select_dtypes(include=['int64','float64'])
numerical_data.head(5)

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,PerformanceRating,HourlyRate,JobInvolvement,JobLevel
0,41,1102,1,2,1,1,2,3,94,3,2
1,49,279,8,1,1,2,3,4,61,2,2
2,37,1373,2,2,1,4,4,3,92,2,1
3,33,1392,3,4,1,5,4,3,56,3,1
4,27,591,2,1,1,7,1,3,40,3,1

In [10]:
categorical_data = df.select_dtypes(include=['object'])
categorical_data.head(5)

,Attrition,BusinessTravel,Department,EducationField,JobRole,Gender,others
0,Yes,Travel_Rarely,Sales,Life Sciences,Sales Executive,Female,Life Sciences
1,No,Travel_Frequently,Research & Development,Life Sciences,Research Scientist,Male,Life Sciences
2,Yes,Travel_Rarely,Research & Development,Other,Laboratory Technician,Male,Other
3,No,Travel_Frequently,Research & Development,Life Sciences,Research Scientist,Female,Life Sciences
4,No,Travel_Rarely,Research & Development,Medical,Laboratory Technician,Male,Medical

# Qs 4

## Part a

In [11]:
data = {"name":["Sadiq","Aminu","Udensi","Olayiwola","Ukpeh","Akinbade",
            "Ezeofor","Oludele","Gbenga","Edgar","Worlu","Magbuwe","Atte","Orogun","Bamigbade"], 
    "job_role": ["Data Engineer","Data Scientist","DevOps Engineer","Research Engineer","Analytical Engineer","Data Analyst","ML Engineer",
                "DevOps Engineer","Analytical Engineer","Data Scientist","MLOps Engineer","Data Engineer",
                "Data Scientist","ML Engineer","Research Engineer",], 
    "salary": [74454, 54900, 76182, 56221, 81254, 75900, 67122, 62426, 61553,77070, 67587, 50095, 75820, 68174, 79069]}
dataframe = pd.DataFrame(data)

## Part b

In [12]:
def create_new(role):
    """
    Given a job role, categorizes it into one of three categories: 'Engineer', 'Analyst/Scientist', or 'other'.

    Args:
        role (str): The job role to be categorized.

    Returns:
        str: The categorized job role.

    Examples:
        >>> create_new('Software Engineer')
        'Engineer'
        >>> create_new('Data Scientist')
        'Analyst/Scientist'
        >>> create_new('Manager')
        'other'
    """    
    if 'engineer' in role.lower():
        return 'Engineer'
    elif 'analyst' in role.lower() or 'scientist' in role.lower():
        return 'Analyst/Scientist'
    else:
        return 'other'
dataframe['title'] = dataframe['job_role'].apply(create_new)
dataframe.head(5)

        name             job_role  salary              title
0      Sadiq        Data Engineer   74454           Engineer
1      Aminu       Data Scientist   54900  Analyst/Scientist
2     Udensi      DevOps Engineer   76182           Engineer
3  Olayiwola    Research Engineer   56221           Engineer
4      Ukpeh  Analytical Engineer   81254           Engineer

## Part c

In [13]:
mean_per_title = round(dataframe.groupby('title').mean())
mean_per_title.head()

                    salary
title
Analyst/Scientist  70922.0
Engineer           67649.0

In [14]:
median_per_title = round(dataframe.groupby('title').median())
median_per_title.head()

                    salary
title
Analyst/Scientist  75860.0
Engineer           67587.0